---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeTopDirn1
source: html/b5aea6cc-baaf-0849-9a4c-4a52a563edcc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeTopDirn1 Property

"Top Major Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeTopDirn1 { get; }
```